app/controllers/api/events_controller.rb

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 27], ["LIMIT", 1]]
UPDATE "events" SET "description" = $1, "updated_at" = $2 WHERE "events"."id" = $3  [["description", "did I change this?"], ["updated_at", "2021-03-24 18:27:25.417266"], ["id", 27]]
---
    def update
        @event = Event.find(params[:id])

        if @event && @event.update_attributes(event_params)