app/controllers/api/users_controller.rb

  def verify
    @user = User.find_by(email: params[:user][:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "eddy@email.com"], ["LIMIT", 1]]